In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
d=DataFrame()
print(d)

Empty DataFrame
Columns: []
Index: []

In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
raw_data={'f':["mooin","minseong","TT","YY","ZZ"],
         'l':["Son","Kim","D","A","Z"],
         'age':[44,11,55,33,22],
         "city":["Seoul","Tokyo","Beijing","New","Miami"]}
c=["f","l","age","city"]
df=pd.DataFrame(raw_data,columns=c)
print(df)

          f    l  age     city
0     mooin  Son   44    Seoul
1  minseong  Kim   11    Tokyo
2        TT    D   55  Beijing
3        YY    A   33      New
4        ZZ    Z   22    Miami

In [4]:
df=DataFrame(raw_data,columns=["f","l","age","city"])
df

          f    l  age     city
0     mooin  Son   44    Seoul
1  minseong  Kim   11    Tokyo
2        TT    D   55  Beijing
3        YY    A   33      New
4        ZZ    Z   22    Miami

In [5]:
df.T

          0         1        2    3      4
f     mooin  minseong       TT   YY     ZZ
l       Son       Kim        D    A      Z
age      44        11       55   33     22
city  Seoul     Tokyo  Beijing  New  Miami

In [7]:
df.T.values

array([['mooin', 'minseong', 'TT', 'YY', 'ZZ'],
       ['Son', 'Kim', 'D', 'A', 'Z'],
       [44, 11, 55, 33, 22],
       ['Seoul', 'Tokyo', 'Beijing', 'New', 'Miami']], dtype=object)

In [8]:
df.values

array([['mooin', 'Son', 44, 'Seoul'],
       ['minseong', 'Kim', 11, 'Tokyo'],
       ['TT', 'D', 55, 'Beijing'],
       ['YY', 'A', 33, 'New'],
       ['ZZ', 'Z', 22, 'Miami']], dtype=object)

In [9]:
df

          f    l  age     city
0     mooin  Son   44    Seoul
1  minseong  Kim   11    Tokyo
2        TT    D   55  Beijing
3        YY    A   33      New
4        ZZ    Z   22    Miami

In [10]:
df["f"].head(3)

0       mooin
1    minseong
2          TT
Name: f, dtype: object

In [11]:
df[["city","age"]].head(3)

      city  age
0    Seoul   44
1    Tokyo   11
2  Beijing   55

In [72]:
s.iloc[:3]

11   NaN
34   NaN
23   NaN
dtype: float64

In [74]:
df.debt=df.age>40

In [77]:
df

          f    l  age     city
0     mooin  Son   44    Seoul
1  minseong  Kim   11    Tokyo
2        TT    D   55  Beijing
3        YY    A   33      New
4        ZZ    Z   22    Miami

In [78]:
df.debt

0     True
1    False
2     True
3    False
4    False
Name: age, dtype: bool

In [79]:
df.T

          0         1        2    3      4
f     mooin  minseong       TT   YY     ZZ
l       Son       Kim        D    A      Z
age      44        11       55   33     22
city  Seoul     Tokyo  Beijing  New  Miami

In [80]:
df.values

array([['mooin', 'Son', 44, 'Seoul'],
       ['minseong', 'Kim', 11, 'Tokyo'],
       ['TT', 'D', 55, 'Beijing'],
       ['YY', 'A', 33, 'New'],
       ['ZZ', 'Z', 22, 'Miami']], dtype=object)

In [81]:
df.to_csv()

',f,l,age,city\r\n0,mooin,Son,44,Seoul\r\n1,minseong,Kim,11,Tokyo\r\n2,TT,D,55,Beijing\r\n3,YY,A,33,New\r\n4,ZZ,Z,22,Miami\r\n'

In [82]:
df

          f    l  age     city
0     mooin  Son   44    Seoul
1  minseong  Kim   11    Tokyo
2        TT    D   55  Beijing
3        YY    A   33      New
4        ZZ    Z   22    Miami

In [84]:
df[["f","l","age"]].head(3)

          f    l  age
0     mooin  Son   44
1  minseong  Kim   11
2        TT    D   55

In [12]:
df["f"][:3]

0       mooin
1    minseong
2          TT
Name: f, dtype: object

In [13]:
a=df["f"]

In [14]:
a

0       mooin
1    minseong
2          TT
3          YY
4          ZZ
Name: f, dtype: object

In [15]:
a[:3]

0       mooin
1    minseong
2          TT
Name: f, dtype: object

In [26]:
df

            l  age     city
f
mooin     Son   44    Seoul
minseong  Kim   11    Tokyo
TT          D   55  Beijing
YY          A   33      New
ZZ          Z   22    Miami

In [34]:
df.iloc[:2,:2]

            l  age
f
mooin     Son   44
minseong  Kim   11

In [38]:
df

            l  age     city
f
mooin     Son   44    Seoul
minseong  Kim   11    Tokyo
TT          D   55  Beijing
YY          A   33      New
ZZ          Z   22    Miami

In [44]:
df

            l  age     city
f
mooin     Son   44    Seoul
minseong  Kim   11    Tokyo
TT          D   55  Beijing
YY          A   33      New
ZZ          Z   22    Miami

In [46]:
df.drop("mooin")

            l  age     city
f
minseong  Kim   11    Tokyo
TT          D   55  Beijing
YY          A   33      New
ZZ          Z   22    Miami

In [53]:
df.drop("age",axis=1)

KeyError: "['age'] not found in axis"

In [51]:
df.drop("l",axis=1,inplace=True)

In [52]:
df

             city
f
mooin       Seoul
minseong    Tokyo
TT        Beijing
YY            New
ZZ          Miami

In [57]:
s1=Series(range(1,6),index=list("abcde"))
s2=Series(range(5,11),index=list("bcedef"))

In [58]:
s1+s2

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [59]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [60]:
df=DataFrame(np.arange(16).reshape(4,4),columns=list("abcd"))
a=Series(np.arange(10,14),index=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [61]:
df+a

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [65]:
s1=Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [66]:
s1.map(lambda x:x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [67]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [72]:
z={1:'A',2:'B',3:'C'}
a=s1.map(z)

In [73]:
a

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [74]:
s2=Series(np.arange(10,20))
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [82]:
memory={"earn":[79751,96396,48710,80478,82089],
       "height":[73.89,66.23,63.77,63.22,63.08],
       "sex":["male","female","female","female","female"],
       "race":["white","white","white","other","white"],
       "ed":[16,16,16,16,17],
       "age":[49,62,33,95,43]}
df=pd.DataFrame(memory,columns=["earn","height","sex","race","ed","age"])
df

    earn  height     sex   race  ed  age
0  79751   73.89    male  white  16   49
1  96396   66.23  female  white  16   62
2  48710   63.77  female  white  16   33
3  80478   63.22  female  other  16   95
4  82089   63.08  female  white  17   43

In [83]:
df.earn.unique()

array([79751, 96396, 48710, 80478, 82089], dtype=int64)

In [84]:
df["e-code"]=df.earn.map({79751:0, 96396:1, 48710:2, 80478:3, 82089:4})

In [85]:
df

    earn  height     sex   race  ed  age  e-code
0  79751   73.89    male  white  16   49       0
1  96396   66.23  female  white  16   62       1
2  48710   63.77  female  white  16   33       2
3  80478   63.22  female  other  16   95       3
4  82089   63.08  female  white  17   43       4

In [90]:
df.age.replace([49,62,33],
              ["old","oold","young"],inplace=True)

In [91]:
df

    earn  height     sex   race  ed    age  e-code
0  79751   73.89    male  white  16    old       0
1  96396   66.23  female  white  16   oold       1
2  48710   63.77  female  white  16  young       2
3  80478   63.22  female  other  16     95       3
4  82089   63.08  female  white  17     43       4

In [96]:
f=lambda x:-x
df["ed"].apply(f).head(5)
df.describe()

               earn     height         ed    e-code
count      5.000000   5.000000   5.000000  5.000000
mean   77484.800000  66.038000  16.200000  2.000000
std    17470.805411   4.569614   0.447214  1.581139
min    48710.000000  63.080000  16.000000  0.000000
25%    79751.000000  63.220000  16.000000  1.000000
50%    80478.000000  63.770000  16.000000  2.000000
75%    82089.000000  66.230000  16.000000  3.000000
max    96396.000000  73.890000  17.000000  4.000000

In [99]:
print(enumerate(df["sex"].unique()))

<enumerate object at 0x0000019EF7ECC640>